Updated architecture documents
